codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz0512efk064.h
#define _CEPOLLCON_BDPPLCON_POSITION             0x00000000
#define _CEPOLLCON_BDPPLCON_MASK                 0x0000FFFF
#define _CEPOLLCON_BDPPLCON_LENGTH               0x00000010

#define _CEHDLEN_HDRLEN_POSITION                 0x00000000
#define _CEHDLEN_HDRLEN_MASK                     0x000000FF
#define _CEHDLEN_HDRLEN_LENGTH                   0x00000008

#define _CETRLLEN_TRLRLEN_POSITION               0x00000000
#define _CETRLLEN_TRLRLEN_MASK                   0x000000FF
#define _CETRLLEN_TRLRLEN_LENGTH                 0x00000008

#define _RNGVER_REVISION_POSITION                0x00000000
#define _RNGVER_REVISION_MASK                    0x0000007F
#define _RNGVER_REVISION_LENGTH                  0x00000007

#define _RNGVER_VERSION_POSITION                 0x00000007
#define _RNGVER_VERSION_MASK                     0x0000FF80
#define _RNGVER_VERSION_LENGTH                   0x00000009

#define _RNGVER_ID_POSITION                      0x00000010
#define _RNGVER_ID_MASK                          0xFFFF0000
#define _RNGVER_ID_LENGTH                        0x00000010

#define _RNGCON_PLEN_POSITION                    0x00000000
#define _RNGCON_PLEN_MASK                        0x000000FF
#define _RNGCON_PLEN_LENGTH                      0x00000008

#define _RNGCON_TRNGEN_POSITION                  0x00000008
#define _RNGCON_TRNGEN_MASK                      0x00000100
#define _RNGCON_TRNGEN_LENGTH                    0x00000001

#define _RNGCON_PRNGEN_POSITION                  0x00000009
#define _RNGCON_PRNGEN_MASK                      0x00000200
#define _RNGCON_PRNGEN_LENGTH                    0x00000001

#define _RNGCON_CONT_POSITION                    0x0000000A
#define _RNGCON_CONT_MASK                        0x00000400
#define _RNGCON_CONT_LENGTH                      0x00000001

#define _RNGCON_TRNGMODE_POSITION                0x0000000B
#define _RNGCON_TRNGMODE_MASK                    0x00000800
#define _RNGCON_TRNGMODE_LENGTH                  0x00000001

#define _RNGCON_LOAD_POSITION                    0x0000000C
#define _RNGCON_LOAD_MASK                        0x00001000
#define _RNGCON_LOAD_LENGTH                      0x00000001

#define _RNGPOLY1_POLY_POSITION                  0x00000000
#define _RNGPOLY1_POLY_MASK                      0xFFFFFFFF
#define _RNGPOLY1_POLY_LENGTH                    0x00000020

#define _RNGPOLY2_POLY_POSITION                  0x00000000
#define _RNGPOLY2_POLY_MASK                      0xFFFFFFFF
#define _RNGPOLY2_POLY_LENGTH                    0x00000020

#define _RNGNUMGEN1_RNG_POSITION                 0x00000000
#define _RNGNUMGEN1_RNG_MASK                     0xFFFFFFFF
#define _RNGNUMGEN1_RNG_LENGTH                   0x00000020

#define _RNGNUMGEN2_RNG_POSITION                 0x00000000
#define _RNGNUMGEN2_RNG_MASK                     0xFFFFFFFF
#define _RNGNUMGEN2_RNG_LENGTH                   0x00000020

#define _RNGSEED1_SEED_POSITION                  0x00000000
#define _RNGSEED1_SEED_MASK                      0xFFFFFFFF
#define _RNGSEED1_SEED_LENGTH                    0x00000020

#define _RNGSEED2_SEED_POSITION                  0x00000000
#define _RNGSEED2_SEED_MASK                      0xFFFFFFFF
#define _RNGSEED2_SEED_LENGTH                    0x00000020

#define _RNGCNT_RCNT_POSITION                    0x00000000
#define _RNGCNT_RCNT_MASK                        0x0000007F
#define _RNGCNT_RCNT_LENGTH                      0x00000007

#define _SBFLAG_T0PGV_POSITION                   0x00000000
#define _SBFLAG_T0PGV_MASK                       0x00000001
#define _SBFLAG_T0PGV_LENGTH                     0x00000001

#define _SBFLAG_T1PGV_POSITION                   0x00000001
#define _SBFLAG_T1PGV_MASK                       0x00000002
#define _SBFLAG_T1PGV_LENGTH                     0x00000001

#define _SBFLAG_T2PGV_POSITION                   0x00000002
#define _SBFLAG_T2PGV_MASK                       0x00000004
#define _SBFLAG_T2PGV_LENGTH                     0x00000001

#define _SBFLAG_T3PGV_POSITION                   0x00000003
#define _SBFLAG_T3PGV_MASK                       0x00000008
#define _SBFLAG_T3PGV_LENGTH                     0x00000001

#define _SBFLAG_T4PGV_POSITION                   0x00000004
#define _SBFLAG_T4PGV_MASK                       0x00000010
#define _SBFLAG_T4PGV_LENGTH                     0x00000001

#define _SBFLAG_T5PGV_POSITION                   0x00000005
#define _SBFLAG_T5PGV_MASK                       0x00000020
#define _SBFLAG_T5PGV_LENGTH                     0x00000001

#define _SBFLAG_T6PGV_POSITION                   0x00000006
#define _SBFLAG_T6PGV_MASK                       0x00000040
#define _SBFLAG_T6PGV_LENGTH                     0x00000001

#define _SBFLAG_T7PGV_POSITION                   0x00000007
#define _SBFLAG_T7PGV_MASK                       0x00000080
#define _SBFLAG_T7PGV_LENGTH                     0x00000001

#define _SBFLAG_T8PGV_POSITION                   0x00000008
#define _SBFLAG_T8PGV_MASK                       0x00000100
#define _SBFLAG_T8PGV_LENGTH                     0x00000001

#define _SBFLAG_T9PGV_POSITION                   0x00000009
#define _SBFLAG_T9PGV_MASK                       0x00000200
#define _SBFLAG_T9PGV_LENGTH                     0x00000001

#define _SBFLAG_T10PGV_POSITION                  0x0000000A
#define _SBFLAG_T10PGV_MASK                      0x00000400
#define _SBFLAG_T10PGV_LENGTH                    0x00000001

#define _SBFLAG_T11PGV_POSITION                  0x0000000B
#define _SBFLAG_T11PGV_MASK                      0x00000800
#define _SBFLAG_T11PGV_LENGTH                    0x00000001

#define _SBFLAG_T12PGV_POSITION                  0x0000000C
#define _SBFLAG_T12PGV_MASK                      0x00001000
#define _SBFLAG_T12PGV_LENGTH                    0x00000001

#define _SBFLAG_T13PGV_POSITION                  0x0000000D
#define _SBFLAG_T13PGV_MASK                      0x00002000
#define _SBFLAG_T13PGV_LENGTH                    0x00000001

#define _SBT0ELOG1_CMD_POSITION                  0x00000000
#define _SBT0ELOG1_CMD_MASK                      0x00000007
#define _SBT0ELOG1_CMD_LENGTH                    0x00000003

#define _SBT0ELOG1_REGION_POSITION               0x00000004
#define _SBT0ELOG1_REGION_MASK                   0x000000F0
#define _SBT0ELOG1_REGION_LENGTH                 0x00000004

